src/Catalogs/МедицинскиеКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>МедицинскиеКарты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВладелецКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМедицинскойКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыМедицинскихКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодБезНулей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечатнаяФорма</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеМедКартыОртодонтПациента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПартииНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/ВидыМедицинскихКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыМедицинскихКарт</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДлинаНомера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Суффикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечатнаяФорма</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПечатныеФормыМедицинскихКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/МедицинскиеКарты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийЭлементовФормы

&НаСервере
// Обработчик события "ПриСозданииНаСервере" объекта.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Элементы.Код.Видимость          = ?(ОтображниеКода, Истина, Ложь);
	Элементы.Код.ПоложениеЗаголовка = ?(ОтображниеКода, ПоложениеЗаголовкаЭлементаФормы.Авто, ПоложениеЗаголовкаЭлементаФормы.Нет);
	
	ТекущееМестоположение = Справочники.МедицинскиеКарты.ВернутьМестоположениеМедицинскойКарты(Объект.Ссылка);
	Если Объект.Ссылка.Пустая() Тогда
		Если Объект.ВидМедицинскойКарты.Пустая() Тогда 
			Объект.ВидМедицинскойКарты = Справочники.ВидыМедицинскихКарт.ОсновнойВидМедицинскойКарты;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ТекущееМестоположение) Тогда
			ТекущееМестоположение = Справочники.Местоположения.ВКлинике;
		КонецЕсли;
	КонецЕсли;	
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
	Если ЗначениеЗаполнено(Объект.ВладелецКарты) Тогда 
		Элементы.ВладелецКарты.Видимость = Ложь;
	КонецЕсли;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры 

&НаКлиенте
// Процедура, Обработка оповещения.  
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОБНОВЛЕНО_МЕСТОПОЛОЖЕНИЕ_МЕДИЦИНСКОЙ_КАРТЫ" И Параметр = Объект.Ссылка Тогда
		ТекущееМестоположение = ВернутьМестоположениеМедицинскойКарты(Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Обработчик события "ПриЗаписиНаСервере" объекта.
//
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Справочники.МедицинскиеКарты.УстановитьМестоположениеМедицинскойКарты(ТекущийОбъект.Ссылка, ТекущееМестоположение);
	
КонецПроцедуры
    
&НаКлиенте
// Обработчик события "ПослеЗаписи" объекта
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОБНОВЛЕНЫ_МЕДИЦИНСКИЕ_КАРТЫ_КЛИЕНТА", Объект.ВладелецКарты, Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Обработчик события "КодПриИзменении".
//
Процедура КодПриИзменении(Элемент)
	
	КоличествоСимволов = ВернутьДлинуКода();
	Если СтрДлина(Объект.Код) <> КоличествоСимволов Тогда 
		Если СтрДлина(Объект.Код) < КоличествоСимволов Тогда
			Количество = КоличествоСимволов - СтрДлина(Объект.Код);
			Если Количество = 1 ИЛИ Количество = 4 Тогда 
				Текст = "Неверно введен код!" + Символы.ПС + "Не хватает " + Количество + " символа!";
			ИначеЕсли Количество = 2 ИЛИ Количество = 3 Тогда 
				Текст = "Неверно введен код!" + Символы.ПС + "Не хватает " + Количество + "-х символов!";
			Иначе 
				Текст = "Неверно введен код!" + Символы.ПС + "Не хватает " + Количество + " символов!";
			КонецЕсли;
		Иначе 
			Количество = СтрДлина(Объект.Код) - КоличествоСимволов;
			Если Количество = 1 Тогда 
				Текст = "Неверно введен код!" + Символы.ПС + "Введен " + Количество + " лишний символ!";
			ИначеЕсли Количество = 2 ИЛИ Количество = 3 ИЛИ Количество = 4 Тогда 
				Текст = "Неверно введен код!" + Символы.ПС + "Введено " + Количество + " лишних символа!";
			Иначе 
				Текст = "Неверно введен код!" + Символы.ПС + "Введено " + Количество + " лишних символов!";
			КонецЕсли;
		КонецЕсли;	
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = Текст;
		Сообщение.Поле = "Объект.Код";
		Сообщение.УстановитьДанные(Объект.Ссылка);
		Сообщение.Сообщить();
	КонецЕсли;		
	             
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Обработчик кнопки автогенерации штрихкода карты
//
Процедура СгенерироватьШтрихкод(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("СгенерироватьШтрихкодЗавершение", ЭтотОбъект), "Медицинская карта не сохранена. Сохранить?", РежимДиалогаВопрос.ДаНет);
        Возврат;
	КонецЕсли;
		
	Объект.Штрихкод = СгенерироватьШтрихкодНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СгенерироватьШтрихкодЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;  
	
	Если Записать() = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Штрихкод = СгенерироватьШтрихкодНаСервере();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедцрыИФункции

&НаСервереБезКонтекста
// Сформировать штрихкод формата EAN13
//
Функция СгенерироватьШтрихкодНаСервере()
	
	Возврат РегистрыСведений.Штрихкоды.СформироватьШтрихкодEAN13();
	
КонецФункции

&НаСервереБезКонтекста
// Сформировать штрихкод формата EAN13
//
Функция ВернутьМестоположениеМедицинскойКарты(МедицинскаяКарта)
	
	Возврат Справочники.МедицинскиеКарты.ВернутьМестоположениеМедицинскойКарты(МедицинскаяКарта);
	
КонецФункции

&НаСервере
// Функция, Вернуть длину кода.
//
Функция ВернутьДлинуКода()
	
	Возврат СтрДлина(Справочники.МедицинскиеКарты.СгенерироватьКодМедКарты(Объект.ВидМедицинскойКарты.ДлинаНомера, Объект.ВидМедицинскойКарты.Префикс, Объект.ВидМедицинскойКарты.Суффикс));
	             
КонецФункции

#КонецОбласти
